dataset_gen/Earlier_Datasets/Hole_Location_Change/CE_CRP_openfoam/Design_Point_0_copy_1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16320
(
(0.00390624 0.00390625 0.05)
(0.0117187 0.00390625 0.05)
(0.0195312 0.00390625 0.05)
(0.0273437 0.00390625 0.05)
(0.0351562 0.00390625 0.05)
(0.0429687 0.00390625 0.05)
(0.0507812 0.00390625 0.05)
(0.0585936 0.00390625 0.05)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.261718 0.757812 0.05)
(0.269531 0.757812 0.05)
(0.277343 0.757812 0.05)
(0.285156 0.757812 0.05)
(0.292968 0.757812 0.05)
(0.300781 0.757812 0.05)
(0.308593 0.757812 0.05)
(0.316406 0.757812 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
